# 2025 학사일정 데이터 (대지고등학교)

events = {
    # 1학기
    "2025-03-01": "삼일절",
    "2025-03-02": "입학식 및 개학식",
    "2025-03-07": "전국연합학력평가(3학년)",
    "2025-03-19": "학부모총회",
    "2025-03-24": "1차 지필평가 시작",
    "2025-03-25": "1차 지필평가",
    "2025-03-26": "1차 지필평가",
    "2025-03-27": "1차 지필평가",
    "2025-03-28": "1차 지필평가 종료, 성적이의신청기간 시작",
    "2025-04-09": "전국연합학력평가(3학년)",
    "2025-04-22": "1차 지필평가(일부 과목 보충)",
    "2025-04-30": "성적이의신청기간 종료",

    "2025-05-05": "어린이날",
    "2025-05-19": "학부모 상담주간 시작",
    "2025-05-23": "학부모 상담주간 종료",
    "2025-05-30": "전국연합평가 (1,2,3학년)",

    "2025-06-06": "현충일",
    "2025-06-07": "전국연합(3학년)",
    "2025-06-24": "2차 지필평가 시작",
    "2025-06-25": "2차 지필평가",
    "2025-06-26": "2차 지필평가",
    "2025-06-27": "2차 지필평가 종료",

    "2025-07-18": "방학식",

    # 2학기
    "2025-08-22": "건강검진 (1학년)",
    "2025-08-25": "전국연합평가 (1,2,3학년)",

    "2025-09-25": "1차 지필평가 시작 (3학년)",
    "2025-09-26": "1차 지필평가 (3학년)",
    "2025-09-29": "1차 지필평가 (3학년)",
    "2025-09-30": "1차 지필평가 (3학년)",

    "2025-10-01": "1차 지필평가 종료 (3학년)",
    "2025-10-03": "개천절",
    "2025-10-14": "전국연합평가 (1,2,3학년)",
    "2025-10-20": "1차 지필평가 시작 (1,2학년)",
    "2025-10-21": "1차 지필평가 (1,2학년)",
    "2025-10-22": "1차 지필평가 (1,2학년)",
    "2025-10-23": "1차 지필평가 종료 (1,2학년)",
    "2025-10-24": "성적이의 신청기간",
    "2025-10-27": "성적이의 신청기간",
    "2025-10-28": "성적이의 신청기간 (목요일 시간표)",

    "2025-11-03": "학부모 상담주간 (1,2학년)",
    "2025-11-07": "학부모 수업 공개의 날 (1,2학년)",
    "2025-11-13": "대학수학능력시험(재량휴업일)",
    "2025-11-17": "2차 지필평가 시작 (3학년)",
    "2025-11-18": "2차 지필평가 종료 (3학년)",
    "2025-11-28": "축제, 동아리 발표회",

    "2025-12-18": "2차 지필평가 시작 (1,2학년)",
    "2025-12-19": "2차 지필평가 (1,2학년)",
    "2025-12-22": "2차 지필평가 (1,2학년)",
    "2025-12-23": "2차 지필평가 종료 (1,2학년)",
    "2025-12-24": "성적이의 신청기간",
    "2025-12-25": "성탄절",
    "2025-12-26": "성적이의 신청기간",
    "2025-12-29": "성적이의 신청기간",

    "2026-01-01": "새해 첫 날",
    "2026-01-05": "학교주도활동(목요일시간표) (1학년)",
    "2026-01-06": "학교주도활동 (1학년)",
    "2026-01-08": "종업식, 졸업식"
}
